---
kind: property
id: P:Autodesk.Revit.DB.ShapeImporter.IsValidObject
source: html/d48b1ede-f225-e449-70bb-67145f62caf4.htm
---
# Autodesk.Revit.DB.ShapeImporter.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.